*** map
#+begin_src python :results output
items = [1,2,3,4,5,6,7,8,9]
print(map(lambda x: x**2, items))
#+end_src

#+RESULTS:
: [1, 4, 9, 16, 25, 36, 49, 64, 81]

*** filter
#+begin_src python :results output
items = range(-5, 5)
print(filter(lambda x: x<=0, items))
#+end_src

#+RESULTS:
: [-5, -4, -3, -2, -1, 0]

*** reduce
#+begin_src python :results output
items = [5, 4, 0, 3, 5, 0, 2, 0, 0, 2, 2, 4, 3, 0, 2, 3]
print(reduce(lambda x, y: x+y, items))
#+end_src

#+RESULTS:
: 35

*** flatten list
#+begin_src python :results output
import functools
import operator
grid = [[5, 4, 0, 3], [5, 0, 2, 0], [0, 2, 2, 4], [3, 0, 2, 3]]
items = [[1,2],[3,4], [789, 43, 32]]
print sum(items, list())
print sum(grid, list())
print functools.reduce(operator.iconcat, items, list())
#+end_src

#+RESULTS:
: [1, 2, 3, 4, 789, 43, 32]
: [5, 4, 0, 3, 5, 0, 2, 0, 0, 2, 2, 4, 3, 0, 2, 3]
: [1, 2, 3, 4, 789, 43, 32]

** Working with strings
#+begin_src python :results output
my_book = ["hola", "que", "tal", "que", "tal", "vas", "vas", "a", "francia", "o", "vas", "a", "espana"]
print(len(set(my_book)))
print(len(my_book))


#+end_src

#+RESULTS:
: 8
: 13

#+begin_src python :results output
def lexical_sweep(text, samples=10):
    '''
    Lexical sweep.
    '''
    log_behaviour_start = 5000
    sweep_values = []
    log_behaviour_range = len(text) - log_behaviour_start
    log_step = log_behaviour_range/(samples - 1)
    if len(text) > 10000 and samples >= 2:
        for sample_size in xrange(
                log_behaviour_start,
                len(text) - 1,
                log_step):
            x_sample = sample_size
            y_sample = len(set(text[0:sample_size]))
            sweep_values.append([x_sample, y_sample])
        return sweep_values
    return False

#+end_src

*** DONE twoSum
    CLOSED: [2019-11-25 Mon 16:54]
    #+begin_src python :results output
# -*- coding: utf-8 -*-

def twoSum(nums, target):
    numsset = set(nums)
    for index, value in enumerate(nums):
        if (target - value) in numsset:
            if index != nums.index(target-value):
                return [index, nums.index(target-value)]

print twoSum([3, 3], 6)
print twoSum([2, 7, 11, 15], 9)
my_list = [576, 782, 3213, 1234314, 545, 54326]
my_indexed_list = [[counter, value] for counter, value in enumerate(my_list)]
#print my_indexed_list
#+end_src

#+RESULTS:
: [1, 0]
: [0, 1]
*** DONE oddCells
    CLOSED: [2019-11-25 Mon 16:54]
#+begin_src python :results output
# -*- coding: utf-8 -*-
def oddCells(n, m, indices):
    matrix = [ [ 0 for i in range(n) ] for j in range(m) ]
    for index in indices:
        if index[0] != index[1]:
            pass

#def addValueToColumn(array, column):

n = 2
m = 3
indices = [[0,1],[1,1]]
# Expected result: 6
matrix = [ [ 0 for i in range(n) ] for j in range(m) ]
matrix = [ [ i+1 for i in range(n) ] for j in range(m) ]
print matrix
#+end_src

#+RESULTS:
: [[1, 2], [1, 2], [1, 2]]
*** DONE distributeCandies
    CLOSED: [2019-11-25 Mon 16:54]
    #+begin_src python :results output
# -*- coding: utf-8 -*-
def distributeCandies(candies, num_people):
    people = [[index, 0] for index, _ in enumerate(range(num_people))]
    quantity_given = 0
    while(candies):
        for index, net_value in people:
            if (candies - quantity_given > 0):
                quantity_given += 1
            else:
                quantity_given = candies
            people[index][1] += quantity_given
            candies -= quantity_given
    return [value for index, value in people]

def test_distributeCandies():
    assert distributeCandies(10, 4) == [1, 2, 3, 4]

num_people = 4
people = [[index, 0] for index, _ in enumerate(range(num_people))]
print people
print distributeCandies(7, 4)
#+end_src

#+RESULTS:
: [[0, 0], [1, 0], [2, 0], [3, 0]]
: [1, 2, 3, 1]

Con _
#+begin_quote
Status: Accepted (27/27)

Runtime: 40 ms, faster than 77.35% of Python3 submissions.

Memory Usage: 12.9 MB, less than 100.00% of Python3 submissions.
#+end_quote

Sin _
#+begin_quote

#+end_quote
*** DONE Jewels and Stones
    CLOSED: [2019-11-25 Mon 16:54]
    #+begin_src python :results output
# -*- coding: utf-8 -*-
import re
def numJewelsInStones(J, S):
    jewels = J
    stones = S
    hits = 0
    for jewel in jewels:
        hits += len(re.findall(jewel, stones))
    return hits
def test_numJewelsInStones():
    assert numJewelsInStones(J = "aA", S = "aAAbbbb") == 3
    assert numJewelsInStones(J = "z", S = "ZZ") == 0

test_numJewelsInStones()
print numJewelsInStones(J = "aA", S = "aAAbbbb")
print numJewelsInStones(J = "z", S = "ZZ")
#+end_src

#+RESULTS:
: 3
: 0

*** DONE maxIncreaseKeepingSkyline
    CLOSED: [2019-11-25 Mon 16:54]
    #+begin_src python :results output
# -*- coding: utf-8 -*-
def skyline(grid):
    row_maxes = [max(row) for row in grid]
    col_maxes = [max(column) for column in zip(*grid)]
    return row_maxes, col_maxes

def maxIncreaseKeepingSkyline(grid):
    flatten_grid = sum(increaseKeepingSkyline(grid), [])
    return reduce(lambda x, y: x + y, flatten_grid)

def increaseKeepingSkyline(grid):
    row_maxes, col_maxes = skyline(grid)
    delta_grid = [[min(row_maxes[r], col_maxes[c]) - value for c, value in enumerate(row)] for r, row in enumerate(grid)]
    return delta_grid

def test_maxIncreaseKeepingSkyline():
    assert maxIncreaseKeepingSkyline(grid = [[3,0,8,4],[2,4,5,7],[9,2,6,3],[0,3,1,0]]) == 35

test_maxIncreaseKeepingSkyline()
grid = [[3,0,8,4],[2,4,5,7],[9,2,6,3],[0,3,1,0]]
print maxIncreaseKeepingSkyline(grid)
#print sum(increaseKeepingSkyline(grid), [])
#print reduce(lambda x, y: x + y, maxIncreaseKeepingSkyline(grid))
#+end_src

#+RESULTS:
: 35

**** What does ** (double star/asterisk) and * (star/asterisk) do for parameters?
     #+begin_src python :results output
# -*- coding: utf-8 -*-
def foo(*args):
    for a in args:
        print a


foo(1)
foo(1,2,3)

def bar(**kwargs):
    for a in kwargs:
        print a, kwargs[a]

bar(name='one', age=27)
#+end_src

#+RESULTS:
: 1
: 1
: 2
: 3
: age 27
: name one

*** DONE minTimeToVisitAllPoints
    CLOSED: [2019-11-26 Tue 10:10]
#+begin_src python :results output
# -*- coding: utf-8 -*-
def distanceBetweenPoints(origin, destination):
    return map(lambda x: abs(x[0] - x[1]), [[x, y] for x,y in zip(origin, destination)])
def timeToCoverDistance(distance):
    return max(distance[0], distance[1])
def timeToVisitAPoint(origin, destination):
    distance = distanceBetweenPoints(origin, destination)
    return timeToCoverDistance(distance)
def minTimeToVisitAllPoints(points):
    distance = 0
    for index, point in enumerate(points):
        if index != len(points) - 1:
            distance += timeToVisitAPoint(point, points[index + 1])
    return distance

def minTimeToVisitAllPointsReduce(points):
    pass

def test_minTimeToVisitAllPoints():
    assert minTimeToVisitAllPoints([[1,1],[3,4],[-1,0]]) == 7
#test_minTimeToVisitAllPoints()
print timeToCoverDistance([90, 40])
print timeToVisitAPoint([45, 45], [90, 49])
print distanceBetweenPoints([1,1], [-2, 4])
print minTimeToVisitAllPoints([[1,1],[3,4],[-1,0]])
print minTimeToVisitAllPointsReduce([[1,1],[3,4],[-1,0]])
#+end_src

#+RESULTS:
: 90
: 45
: [3, 3]
: 7
: None

*** DONE isMatch
    CLOSED: [2019-11-27 Wed 10:38]
    #+begin_src python :results output
# -*- coding: utf-8 -*-
import re
def isMatch(s, p):
    if re.search(r'a*', s):
        return True
    return False
def test_isMatch():
    assert isMatch("aa", "a*") == True
#test_isMatch()
pattern = re.compile(r'a*')
print re.search(r'a*', 'aa')
#+end_src

#+RESULTS:
: <_sre.SRE_Match object at 0x7fc2e57e8b28>

** Maps
   #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h>
   #+HEADER: :flags -std=c++11
   #+begin_src C++ :results verbatim
#include <iostream>
#include <map>
#include <string>
#include <iterator>
#include <algorithm>
int main() {

std::map<std::string, int> mapOfWordCount;
// Insert Element in map
mapOfWordCount.insert(std::pair<std::string, int>("first", 1));
mapOfWordCount.insert(std::pair<std::string, int>("second", 2));
mapOfWordCount.insert(std::pair<std::string, int>("third", 3));
mapOfWordCount.insert(std::pair<std::string, int>("forth", 4));
mapOfWordCount.insert(std::pair<std::string, int>("third", 5));
// Create a map iterator and point to beginning of map
std::map<std::string, int>::iterator it = mapOfWordCount.begin();
// Iterate over the map using Iterator till end.
while (it != mapOfWordCount.end())
{
// Accessing KEY from element pointed by it.
std::string word = it->first;
// Accessing VALUE from element pointed by it.
int count = it->second;
std::cout << word << " :: " << count << std::endl;
// Increment the Iterator to point to next entry
it++;
}
return 0;
}
   #+end_src

   #+RESULTS:
   : first :: 1
   : forth :: 4
   : second :: 2
   : third :: 3
** Compare
   #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory>
   #+HEADER: :flags -std=c++11
   #+begin_src C++ :results output
std::string first = "lol";
std::string second = "lol";
if (!first.compare(second)) {
  std::cout << "comparison success" << "\n";
}
else {
  std::cout << "comparison fail" << "\n";
}
   #+end_src

   #+RESULTS:
   : comparison success
*** Version
    #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory> <bits/stdc++.h> <set>
    #+HEADER: :flags -std=c++17
    #+begin_src C++ :results output
#include <boost/version.hpp>
std::cout << "Using Boost "
          << BOOST_VERSION / 100000     << "."  // major version
          << BOOST_VERSION / 100 % 1000 << "."  // minor version
          << BOOST_VERSION % 100                // patch level
          << std::endl;
    #+end_src

    #+RESULTS:
    : Using Boost 1.58.0

** Member initializer lists
#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h>
#+HEADER: :flags -std=c++11
#+begin_src C++
class person
{
    std::string name;
    int age;

public:

    person(const std::string& name, int age) : name(name), age(age)
    {
      std::cout << "Name: " << name << "\n";
      std::cout << "Age: " << age << "\n";
    }
};

int main()
{
    person a("Bjarne Stroustrup", 60);
    person b(a);   // What happens here?
    b = a;         // And here?
}
#+end_src

#+RESULTS:
| Name: | Bjarne | Stroustrup |
| Age:  |     60 |            |
** Why is processing a sorted array faster than processing an unsorted array?
#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h>
#+HEADER: :flags -std=c++11
#+begin_src C++
#include <algorithm>
#include <ctime>
#include <iostream>

int main()
{
    // Generate data
    const unsigned arraySize = 32768;
    int data[arraySize];

    for (unsigned c = 0; c < arraySize; ++c)
      data[c] = std::rand() % 256;

    // !!! With this, the next loop runs faster.
    //std::sort(data, data + arraySize); //6.6553s, without 19.456s

    // Test
    clock_t start = clock();
    long long sum = 0;

    for (unsigned i = 0; i < 100000; ++i)
    {
        // Primary loop
        for (unsigned c = 0; c < arraySize; ++c)
        {
            if (data[c] >= 128)
                sum += data[c];
        }
    }

    double elapsedTime = static_cast<double>(clock() - start) / CLOCKS_PER_SEC;

    std::cout << elapsedTime << std::endl;
    std::cout << "sum = " << sum << std::endl;
}
#+end_src

#+RESULTS:
| 19.2552 |   |              |
|     sum | = | 314931600000 |
** Virtual
#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h>
#+HEADER: :flags -std=c++11
#+begin_src C++ :results output
class Animal
{
public:
  Animal() {};
  ~Animal() {};
  virtual void eat() { std::cout << "I'm eating generic food.\n"; }
};

class Cat : public Animal
{
public:
  Cat() {};
  ~Cat() {};
  void eat() { std::cout << "I'm eating a rat.\n"; }
};

int main() {
  Animal *animal = new Animal;
  //Cat cat;
  //Animal cat;
  Animal *cat = new Cat;
  animal->eat(); // outputs: "I'm eating generic food."
  cat->eat();    // outputs: "I'm eating generic food."
}
#+end_src

#+RESULTS:
: I'm eating generic food.
: I'm eating a rat.

#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h>
#+HEADER: :flags -std=c++11
#+begin_src C++ :results output
class Base
{
public:
  void Method1 ()  {  std::cout << "Base::Method1" << std::endl;  }
  virtual void Method2 ()  {  std::cout << "Base::Method2" << std::endl;  }
};

class Derived : public Base
{
public:
  void Method1 ()  {  std::cout << "Derived::Method1" << std::endl;  }
  void Method2 ()  {  std::cout << "Derived::Method2" << std::endl;  }
};

Base* obj = new Derived ();
//  Note - constructed as Derived, but pointer stored as Base*

obj->Method1 ();  //  Prints "Base::Method1"
obj->Method2 ();  //  Prints "Derived::Method2"
#+end_src

#+RESULTS:
: Base::Method1
: Derived::Method2
** Strings and chars and ASCII
   #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory> <bits/stdc++.h> <set>
   #+HEADER: :flags -std=c++11
   #+begin_src C++ :results output
std::string my_string = "Roland";
char my_char = my_string[0];
std::cout << my_char;
   #+end_src

   #+RESULTS:
   : R


#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory> <bits/stdc++.h> <set>
#+HEADER: :flags -std=c++11
#+begin_src C++ :results output
int asciiValue = 65;
char character = char(asciiValue);
std::cout << character << "\n"; // output: A
std::cout << char(90) << "\n"; // output: Z
int side = 49;
char char_side = char(side);
std::cout << char_side << "\n";
#+end_src

#+RESULTS:
: A
: Z
: 1


** ABS
   #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory>
   #+HEADER: :flags -std=c++11
   #+begin_src C++ :results output
std::cout << std::numeric_limits<int64_t>::max() << "\n";
std::cout << std::numeric_limits<int64_t>::min() << "\n";
std::cout << std::abs(std::numeric_limits<int64_t>::max()) << "\n";
std::cout << std::abs(std::numeric_limits<int64_t>::min()) << "\n";
   #+end_src

   #+RESULTS:
   : 9223372036854775807
   : -9223372036854775808
   : 9223372036854775807
   : -9223372036854775808
*** ostream
    #+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory> <bits/stdc++.h> <set>
    #+HEADER: :flags -std=c++11
    #+begin_src C++ :results output

// C++ program to print vector objects
// by overloading "<<" operator
#include <iostream>
#include <vector>
using namespace std;

// C++ template to print vector container elements
template <typename T>
ostream& operator<<(ostream& os, const vector<T>& v)
{
    os << "[";
    for (int i = 0; i < v.size(); ++i) {
        os << v[i];
        if (i != v.size() - 1)
            os << ", ";
    }
    os << "]\n";
    return os;
}

// Driver code
int main()
{
    vector<int> vec{ 4, 2, 17, 11, 15 };

    // Printing the elements directly
    cout << vec;

    return 0;
}

    #+end_src

    #+RESULTS:
    : [4, 2, 17, 11, 15]



#+HEADER: :includes <iostream> <numeric> <vector> <stdexcept> <fstream> <sstream> <map> <string> <algorithm> <stdio.h> <memory> <bits/stdc++.h> <set>
#+HEADER: :flags -std=c++11
#+begin_src C++ :results output
auto v = std::vector<int>{1, 2, 3};
std::copy(begin(v), end(v), std::ostream_iterator<int>(std::cout, " "));
#+end_src

#+RESULTS:
: 1 2 3

